<?php
/**
 * Template Name: Front Page with Products
 */

if (function_exists('ppf_add_head_tag')) {
    ppf_add_head_tag('<link rel="shortcut icon" href="{{domain}}/static/icons/favicon.png" type="image/x-icon">');
    ppf_add_head_tag('<meta name="description" content="Поліграфія в Києві - PAPERFOX. Друк А0, А1, А2 та цифровий друк А3 та А4 формата. Якісний друк на полотні, футболках, фото на чашках. Самовивіз в Києві на Подолі та доставка Новою Поштою по Україні">');
    ppf_add_head_tag('<meta name="keywords" content="Печать а0 киев, друк А0 київ, печать а1 киев,  друк А1 київ, печать а2 киев,  друк А2 київ, печать а4 киев, друк А4 київ, печать а3 киев, друк А3 київ, печать на чашках киев, друк на чашках київ,  печать на холсте, друк на холсті (полотні), фото на холсте, фото на холсті (полотні), фотохолст, цветная печать, кольоровий друк, фото на чашках киев, печать наклеек, друк наклейок (наліпок), печать стикеров, друк стікерів,  круглые наклейки, круглі наліпки, фигурные наклейки, фігрні наліпки">');
    ppf_add_head_tag('<meta property="og:title" content="PaperFox - Цифровий та Широкоформатний Друк в Києві">');
    ppf_add_head_tag('<meta property="og:type" content="website">');
    ppf_add_head_tag('<meta property="og:url" content="https://paperfox.com.ua">');
    ppf_add_head_tag('<meta property="og:image" content="https://paperfox.com.ua/wp-content/uploads/images/og-paperfox-main.jpg">');
    ppf_add_head_tag('<meta property="og:description" content="Послуги цифрового друку Paperfox допоможуть вам замовити найкращі індивідуальні продукти:  маркетингові матеріали, листівки, наліпки, рекламну продукцію, холсти, чашки, футболки">');
    ppf_add_head_tag('<meta property="og:site_name" content="PaperFox">');
    ppf_add_head_tag('<meta property="og:locale" content="uk_UA">');
}

add_filter(
    'document_title_parts',
    static function ($parts) {
        if (is_front_page()) {
            $parts['title'] = 'Цифровий та Широкоформатний друк. Поліграфія в Києві | PaperFox';
        }

        return $parts;
    },
    50
);

get_header();
?>

<main id="primary" class="site-main">
    <?php get_template_part('template-parts/ppf-front-page-video-section'); ?>

    @@include('../partials/front-page-our-services.html')

    @@include('../partials/contact-widget.html')

    <?php get_template_part('map', 'widget'); ?>

    <section class="section" id="paperfox_about">
        <div class="container col big_gap width_100">
            <div class="col small_gap partners_info">
                <p class="text_32__bold">PaperFox – поліграфія та крафтова майстерня №1</p>
                <p>PaperFox — майстерня з цифрового друку, широкоформатного друку та виготовлення сувенірної
                    продукції в Києві на Подолі (Контрактова площа). Наша команда професіоналів поєднує творчість та
                    сучасні цифрові технології, щоб створювати продукцію найвищої якості відповідно до ваших потреб.
                </p>
                <p>Ми допомагаємо бізнесам будь-яких масштабів — від стартапів до великих корпорацій — завжди
                    залишатися попереду, за рахунок професійного виготовлення рекламного, поліграфічного та іншого
                    офісного друку. Наш офіс знаходиться на Подолі, але ми надаємо послуги не тільки для киян, але й
                    для замовників з усієї України.</p>
                <p>Наша спеціалізація:</p>
                <ul class="list_disc_small_gap">
                    <li>офсетний друк фірмових бланків, папок, листівок, струганих картонних коробок з тисненням,
                        вибірковим УФ лакуванням, металізованим фольгуванням, тисненням логотипу та покриттям акриловим
                        захисним лаком;</li>
                    <li>широкоформатний друк плакатів на матовому фотопапері високої якості, креслень на ватмані,
                        фотографій. Формат друку А2, B2, А1, B1 та А0;</li>
                    <li>цифровий друк листівок, візиток, бланків, плакатів, документів, будь-якої рекламної та
                        сувенірної поліграфії з постдрукарською обробкою;</li>
                    <li>офсетний та терміновий цифровий друк єврофлерів 21х10 см та листівок від А6 до А3 форматів;</li>
                    <li>друк на футболках методом DTF, флекс плівками та прямий цифровий друк;</li>
                    <li>друк на чашках фотографій і будь-яких зображень, картинок, вітальних або пам’ятних написів,
                        берндування сублімаційним методом на чашках об’ємом 200 мл, 310 мл або 425 мл;</li>
                    <li>офсетний та цифровий друк буклетів, каталогів, брошур;</li>
                    <li>широкоформатний та цифровий друк календарів форматів: А5, А4, А3, А2, А1, А0 формату;</li>
                </ul>
            </div>
            <p>
                Цифровий друк невеликих тиражів і широкоформатний друк постерів здійсниться просто в день замовлення,
                і ми візьмемося за виготовлення навіть єдиного екземпляра – це наше правило непорушне із дня заснування
                у 2015 році. Зручне розташування в центрі Києва на Подолі дасть вам змогу не витрачати багато часу на
                проїзд, до того ж ми можемо доставити готове замовлення кур’єром Нової Пошти за вказаною адресою по
                всій Україні або таксі по Києву. Ми цінуємо ваш час, кошти та гарний настрій, тому працюємо з
                натхненням і сумлінно!</p>
            <p>Ми прагнемо встановити новий стандарт для друку, з чудовими новими продуктами онлайн, які приносять
                дизайн і високі стандарти Інтернету. Хоча багато інших поліграфій вирішили використовувати нові
                технології, щоб просто знизити витрати на друк (і нерідко якість), ми прагнемо зробити друк не тільки
                рентабельним і зручнішим, але й кращим, ніж будь-коли раніше.
            </p>
        </div>
    </section>

    <script>
        document.addEventListener("DOMContentLoaded", () => {
            const video = document.getElementById("background-video");

            const loadVideo = () => {
                const source = document.createElement("source");
                source.src = "{{stylesheet_url}}/static/video/paperfox_office_review_demo.mp4";
                source.type = "video/mp4";
                video.appendChild(source);
                video.load();
            };

            if ("requestIdleCallback" in window) {
                requestIdleCallback(loadVideo, { timeout: 2000 });
            } else {
                setTimeout(loadVideo, 1500);
            }
        });
    </script>
</main>

<?php
get_footer();
